experiments/Qwen3-Coder-Next-FP8/optimal_mcr_cl64000_pro6000/2026-02-26_01-46-38_6f988df7/pro6000_in64000_out8000_vllm_benchmark.txt
============ Benchmark Task ============
recipe_dir: experiments/Qwen3-Coder-Next-FP8/optimal_mcr_cl64000_pro6000
variant: pro6000_in64000_out8000
gpu_name: NVIDIA RTX PRO 6000 Workstation Edition
gpu_count: 1
recipe:
  model:
    huggingface: Qwen/Qwen3-Coder-Next-FP8
  engine:
    llm:
      context_length: 131072
      max_concurrent_requests: 4
      tensor_parallel_size: 1
      pipeline_parallel_size: 1
      gpu_memory_utilization: 0.9
      vllm:
        image: vllm/vllm-openai:latest
        extra_args: ''
      sglang: null
  benchmark:
    max_concurrency: 4
    num_prompts: 8
    random_input_len: 64000
    random_output_len: 8000
  deploy:
    gpu: NVIDIA RTX PRO 6000 Workstation Edition
    gpu_count: 1
==================================================

============ Serving Benchmark Result ============
Successful requests:                     8         
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  279.08    
Total input tokens:                      512000    
Total generated tokens:                  64000     
Request throughput (req/s):              0.03      
Output token throughput (tok/s):         229.32    
Peak output token throughput (tok/s):    284.00    
Peak concurrent requests:                7.00      
Total token throughput (tok/s):          2063.90   
---------------Time to First Token----------------
Mean TTFT (ms):                          16465.44  
Median TTFT (ms):                        16412.02  
P99 TTFT (ms):                           28926.93  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.38     
Median TPOT (ms):                        15.37     
P99 TPOT (ms):                           16.40     
---------------Inter-token Latency----------------
Mean ITL (ms):                           15.38     
Median ITL (ms):                         14.93     
P99 ITL (ms):                            17.83     
==================================================

============ Docker Compose Configuration ============
services:

  vllm_0:
    image: vllm/vllm-openai:latest
    container_name: vllm_0
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              count: all
              capabilities: [gpu]
    volumes:
      - /hf_models:/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=***
      - HF_HOME=/hf_models
    ports:
      - "8000:8000"
    shm_size: '16gb'
    ipc: host
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 1
      --pipeline-parallel-size 1
      --model Qwen/Qwen3-Coder-Next-FP8
      --served-model-name Qwen/Qwen3-Coder-Next-FP8
      --max-model-len 131072
      --max-num-seqs 4
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 600s
==================================================

============ Benchmark Command ============
vllm bench serve
    --model Qwen/Qwen3-Coder-Next-FP8
    --max-concurrency 4
    --num-prompts 8
    --random-input-len 64000
    --random-output-len 8000
    --base-url http://localhost:8000
==================================================

============ System Information ============
=== HOSTNAME ===
riftvm

=== OS ===
PRETTY_NAME="Ubuntu 24.04.1 LTS"
NAME="Ubuntu"
VERSION_ID="24.04"
VERSION="24.04.1 LTS (Noble Numbat)"
VERSION_CODENAME=noble
ID=ubuntu
ID_LIKE=debian
HOME_URL="https://www.ubuntu.com/"
SUPPORT_URL="https://help.ubuntu.com/"
BUG_REPORT_URL="https://bugs.launchpad.net/ubuntu/"
PRIVACY_POLICY_URL="https://www.ubuntu.com/legal/terms-and-policies/privacy-policy"
UBUNTU_CODENAME=noble
LOGO=ubuntu-logo

=== KERNEL ===
6.8.0-51-generic

=== CPU INFORMATION ===
Architecture:                         x86_64
CPU op-mode(s):                       32-bit, 64-bit
Address sizes:                        52 bits physical, 57 bits virtual
Byte Order:                           Little Endian
CPU(s):                               11
On-line CPU(s) list:                  0-10
Vendor ID:                            AuthenticAMD
Model name:                           AMD EPYC 9474F 48-Core Processor
CPU family:                           25
Model:                                17
Thread(s) per core:                   1
Core(s) per socket:                   1
Socket(s):                            11
Stepping:                             1
BogoMIPS:                             7199.99
Flags:                                fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush mmx fxsr sse sse2 syscall nx mmxext fxsr_opt pdpe1gb rdtscp lm rep_good nopl cpuid extd_apicid tsc_known_freq pni pclmulqdq ssse3 fma cx16 pcid sse4_1 sse4_2 x2apic movbe popcnt tsc_deadline_timer aes xsave avx f16c rdrand hypervisor lahf_lm cmp_legacy svm cr8_legacy abm sse4a misalignsse 3dnowprefetch osvw perfctr_core ssbd ibrs ibpb stibp ibrs_enhanced vmmcall fsgsbase tsc_adjust bmi1 avx2 smep bmi2 erms invpcid avx512f avx512dq rdseed adx smap avx512ifma clflushopt clwb avx512cd sha_ni avx512bw avx512vl xsaveopt xsavec xgetbv1 xsaves avx512_bf16 clzero xsaveerptr wbnoinvd arat npt lbrv nrip_save tsc_scale vmcb_clean flushbyasid pausefilter pfthreshold v_vmsave_vmload vgif vnmi avx512vbmi umip pku ospke avx512_vbmi2 gfni vaes vpclmulqdq avx512_vnni avx512_bitalg avx512_vpopcntdq la57 rdpid fsrm flush_l1d arch_capabilities
Virtualization:                       AMD-V
Hypervisor vendor:                    KVM
Virtualization type:                  full
L1d cache:                            704 KiB (11 instances)
L1i cache:                            704 KiB (11 instances)
L2 cache:                             5.5 MiB (11 instances)
L3 cache:                             176 MiB (11 instances)
NUMA node(s):                         1
NUMA node0 CPU(s):                    0-10
Vulnerability Gather data sampling:   Not affected
Vulnerability Itlb multihit:          Not affected
Vulnerability L1tf:                   Not affected
Vulnerability Mds:                    Not affected
Vulnerability Meltdown:               Not affected
Vulnerability Mmio stale data:        Not affected
Vulnerability Reg file data sampling: Not affected
Vulnerability Retbleed:               Not affected
Vulnerability Spec rstack overflow:   Mitigation; Safe RET
Vulnerability Spec store bypass:      Mitigation; Speculative Store Bypass disabled via prctl
Vulnerability Spectre v1:             Mitigation; usercopy/swapgs barriers and __user pointer sanitization
Vulnerability Spectre v2:             Mitigation; Enhanced / Automatic IBRS; IBPB conditional; STIBP disabled; RSB filling; PBRSB-eIBRS Not affected; BHI Not affected
Vulnerability Srbds:                  Not affected
Vulnerability Tsx async abort:        Not affected

=== CPU COUNT ===
11

=== MEMORY ===
               total        used        free      shared  buff/cache   available
Mem:            98Gi       1.3Gi        96Gi       3.0Mi       943Mi        96Gi
Swap:             0B          0B          0B

=== GPU INFORMATION ===
NVIDIA RTX PRO 6000 Blackwell Workstation Edition, 97887 MiB, 580.65.06, P0, 31, 0 %

=== GPU DETAILS ===
Thu Feb 26 01:48:32 2026       
+-----------------------------------------------------------------------------------------+
| NVIDIA-SMI 580.65.06              Driver Version: 580.65.06      CUDA Version: 13.0     |
+-----------------------------------------+------------------------+----------------------+
| GPU  Name                 Persistence-M | Bus-Id          Disp.A | Volatile Uncorr. ECC |
| Fan  Temp   Perf          Pwr:Usage/Cap |           Memory-Usage | GPU-Util  Compute M. |
|                                         |                        |               MIG M. |
|=========================================+========================+======================|
|   0  NVIDIA RTX PRO 6000 Blac...    Off |   00000000:00:10.0 Off |                  Off |
| 30%   31C    P0             75W /  600W |       0MiB /  97887MiB |      2%      Default |
|                                         |                        |                  N/A |
+-----------------------------------------+------------------------+----------------------+

+-----------------------------------------------------------------------------------------+
| Processes:                                                                              |
|  GPU   GI   CI              PID   Type   Process name                        GPU Memory |
|        ID   ID                                                               Usage      |
|=========================================================================================|
|  No running processes found                                                             |
+-----------------------------------------------------------------------------------------+

=== DISK USAGE ===
Filesystem      Size  Used Avail Use% Mounted on
tmpfs           9.9G  1.2M  9.9G   1% /run
efivarfs        256K   17K  234K   7% /sys/firmware/efi/efivars
/dev/vda1       1.5T   14G  1.5T   1% /
tmpfs            50G     0   50G   0% /dev/shm
tmpfs           5.0M     0  5.0M   0% /run/lock
/dev/vda16      881M   62M  758M   8% /boot
/dev/vda15      105M  8.4M   97M   8% /boot/efi
tmpfs           9.9G   20K  9.9G   1% /run/user/1000

=== BLOCK DEVICES ===
NAME    MAJ:MIN RM  SIZE RO TYPE MOUNTPOINTS
sr0      11:0    1  368K  0 rom  
vda     253:0    0  1.5T  0 disk 
├─vda1  253:1    0  1.5T  0 part /
├─vda14 253:14   0    4M  0 part 
├─vda15 253:15   0  106M  0 part /boot/efi
└─vda16 259:0    0  913M  0 part /boot

=== UPTIME ===
 01:48:33 up 1 min,  1 user,  load average: 1.69, 0.55, 0.19

=== DOCKER VERSION ===
Docker version 28.5.1, build e180ab8

=== DOCKER INFO ===
28.5.1 | OS: Ubuntu 24.04.1 LTS | Containers: 0 | Images: 0
==================================================